import 'package:surf_school/models/place.dart';

const List<Place> mockPlaces = [
  Place(
    name: 'Братиславский Град',
    description:
        'Центральный и самый важный замок в Братиславе, который многие века является неотъемлемой частью городской панорамы.',
    type: 'замок',
    images: [
      'https://msmstudy.sk/wp-content/uploads/2021/12/view-bratislava-castle-slovakia-1-scaled.jpg',
    ],
  ),

  Place(
    name: 'Университет Коменского',
    description:
        'Крупнейший университет Словакии. Назван в честь крупного чешского педагога Яна Амоса Коменского. Университет входит в ассоциацию университетов Европы Утрехтская сеть.',
    type: 'университет',
    images: [
      'https://static.tildacdn.com/tild3735-3430-4061-b535-326134333839/08062023_uk_ba_59666.jpg',
    ],
  ),

  Place(
    name: 'Церковь Святой Елизаветы',
    description:
        'Выстроен венгерским архитектором Эдёном Лехнером в стиле модерн. Закладной камень храма был положен в основание фундамента 23 августа 1909 года. Освящение храма в честь Святой Елизаветы Венгерской состоялось в 1913 году.',
    type: 'церковь',
    images: [
      'https://i2.wp.com/svk360.com/wp-content/uploads/2016/11/852.jpg?resize=800%2C445&ssl=1',
    ],
  ),

  Place(
    name: 'Площадь Гвездослава',
    description:
        'Одна из старейших и наиболее известных площадей в историческом центре Братиславы. Также известна как Площадь-Променад. Она расположена в районе Старый город, между мостом SNP и Словацким национальным театром.',
    type: 'замок',
    images: [
      'https://travelfotokor.ru/bratislava/picbig/50hviezdoslavovo.jpg',
    ],
  ),
];
